In [1]:
import numpy as np
import pandas as pd
import os

# Dataset:

Netflix Price Dataset: https://www.kaggle.com/datasets/netflix-inc/netflix-prize-data

# Load Dataset

using with open() to open csv file as:
1. Deal with letters as À, É, ..., etc.
2. Some movies habe multiple titles seperarted by commas.

In [2]:
movies_df = pd.DataFrame(columns=['id', 'year', 'title'])

with open('archive/movie_titles.csv', 'rb') as file:
    for l in file.readlines():
        line_str = l.decode('utf-8', errors="ignore")
        columns = line_str.split(',')
        id_val, date_val, title_val = columns[:3]
        title_val += ', '.join(columns[3:]).strip()
        movies_df = pd.concat([movies_df, pd.DataFrame([{'id':id_val,'year': date_val,'title':title_val}])], ignore_index=True)
        
movies_df.head(3)

movies_df.to_excel("movies_data_final.xlsx")

## Merge all user rating into a single CSV

In [4]:
path = "/Users/himanshuchuri/Desktop/DataScience/Netflix/archive/"

ratings = pd.DataFrame(columns=['movie_id','customer_id','rating','date'])

movie_id = 0
for file in ['combined_data_1.txt','combined_data_2.txt','combined_data_3.txt','combined_data_4.txt','combined_data_4.txt']:
    with open(path+file) as of:
        for f in of.readlines():
            if f.endswith(':\n'):
                movie_id = f[:-2]
            else:
                cust_id, rating, date = f.split(',')
                ratings = pd.concat([ratings, pd.DataFrame([{'movie_id':movie_id,'customer_id':cust_id,'rating':rating,'date':date[:-1]}])], ignore_index=True)

In [22]:
ratings.to_excel("ratings_data_final.xlsx")

       movie_id customer_id rating          date
0             1     1488844      3  2005-09-06\n
1             1      822109      5  2005-05-13\n
2             1      885013      4  2005-10-19\n
3             1       30878      4  2005-12-26\n
4             1      823519      3  2004-05-03\n
...         ...         ...    ...           ...
192410       30     2590717      4  2005-01-05\n
192411       30     2474372      4  2005-01-07\n
192412       30     2050456      3  2005-01-09\n
192413       30     2478187      4  2005-01-10\n
192414       30      237427      2  2005-01-11\n

[192415 rows x 4 columns]